app/controllers/members_controller.rb

  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house

    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "created_at", "updated_at", "house_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["created_at", "2019-01-18 01:04:14.099343"], ["updated_at", "2019-01-18 01:04:14.099343"], ["house_id", 156]]